603.9
707.6
483.3
649.2
663.4
540.7
560.9
596.8
575.9
569.0
598.0
584.3
678.1
567.7
480.1
558.7
644.0
736.0
678.7
642.6
607.1
464.6
764.2
669.5
664.7
569.1
680.1
601.2
733.9
581.4
609.3
581.9
510.1
721.4
639.3
529.1
494.8
597.9
616.6
565.7
685.8
654.8
686.4
667.9
642.2
575.4
628.0
622.6
698.6
717.6
540.3
618.4
536.5
490.2
562.3
677.8
573.9
541.8
603.0
599.9
718.6
579.7
511.5
727.5
486.3
740.3
504.0
738.5
684.0
521.6
593.9
668.6
634.0
729.0
549.5
611.6
552.4
616.1
659.7
691.0
680.9
563.9
612.3
587.3
562.8
677.5
512.8
655.3
721.6
657.5
500.7
695.7
513.7
508.8
698.7
479.8
576.8
502.9
513.3
528.2
576.0
715.4
568.1
632.4
520.2
637.7
702.2
749.6
724.8
722.5
683.6
488.5
588.9
511.2
597.1
484.9
705.3
626.7
737.8
494.2
682.7
489.6
731.1
534.0
573.3
753.2
649.6
740.4
683.7
528.7
614.7
554.2
578.8
608.5
496.9
704.9
524.7
620.5
551.2
563.5
549.0
733.2
622.7
711.7
633.2
556.8
542.4
490.8
643.3
532.5
643.9
662.0
676.5
663.8
659.1
719.0
751.5
556.5
578.6
483.8
647.4
725.5
638.9
526.9
485.5
504.5
504.8
654.0
622.5
737.6
705.8
493.6
596.9
665.3
683.5
688.4
495.2
705.6
561.3
522.9
700.1
540.4
644.1
595.3
526.5
752.1
477.8
525.4
635.5
488.8
501.0
600.7
643.5
663.6
665.5
591.1
575.8
521.1
608.4
758.5
729.1
631.5
594.2
577.0
554.0
538.9
751.3
697.5
446.8
464.8
480.9
609.2
610.7
631.8
573.6
461.9
571.4
626.4
536.2
687.8
555.3
645.2
470.4
702.1
723.3
675.8
522.5
725.7
626.2
688.6
712.0
547.3
497.1
728.7
520.4
671.1
662.5
550.8
478.3
748.0
506.4
610.0
623.8
754.7
707.5
581.2
558.2
727.2
714.5
699.9
634.2
551.5
615.4
568.9
729.5
571.2
505.2
466.1
565.3
754.5
593.3
559.9
600.5
563.0
730.9
513.2
707.7
730.6
610.4
507.6
626.0
555.4
613.3
572.5
561.7
495.5
480.2
498.2
745.9
625.5
505.5
731.7
657.6
601.4
754.2
647.6
678.9
608.7
678.6
431.6
619.9
519.7
467.4
573.8
510.6
671.5
627.5
682.8
627.3
662.2
507.4
693.5
523.0
656.2
623.0
680.5
671.3
492.2
684.5
609.8
583.4
530.3
728.6
515.7
565.5
665.8
616.7
570.2
647.9
670.5
668.0
516.0
763.0
680.8
515.4
512.0
751.6
603.7
710.6
692.1
475.0
648.2
535.8
508.3
533.8
502.5
702.8
692.4
779.2
550.6
703.4
447.5
492.8
641.2
640.8
650.2
591.6
714.7
555.7
560.1
540.2
514.8
605.7
489.8
513.0
496.6
691.5
544.1
546.7
718.5
507.5
634.8
509.5
658.1
539.4
594.9
582.6
610.9
580.0
510.2
668.7
516.1
586.9
585.8
582.2
612.6
669.4
569.7
723.9
605.8
615.9
662.9
427.3
624.5
535.7
684.4
738.1
661.9
590.1
613.6
537.9
487.4
691.4
584.0
570.4
737.9
487.6
679.6
675.5
514.1
539.8
496.4
614.5
496.1
675.0
485.9
721.3
508.1
575.7
616.2
714.9
486.7
643.6
470.3
508.6
523.1
554.4
735.0
575.3
459.2
681.4
444.8
727.1
713.8
612.7
518.4
692.6
536.6
725.3
521.7
696.8
511.6
517.0
494.4
678.4
502.1
477.9
502.3
469.9
525.6
432.5
493.8
515.5
713.9
432.1
478.2
579.3
742.8
693.7
636.9
670.8
610.6
721.8
639.9
634.4
608.2
596.2
720.2
609.9
534.8
571.5
554.3
533.6
482.1
725.2
656.9
699.4
476.3
646.2
691.3
595.1
618.2
546.6
632.8
657.4
722.2
724.3
713.1
654.7
622.0
754.0
734.4
688.7
611.2
751.8
507.3
521.8
582.9
570.9
627.6
526.3
531.3
647.0
568.5
717.1
718.2
529.2
701.8
587.5
501.8
719.9
543.3
687.5
592.6
667.4
483.9
682.5
627.9
786.6
554.7
497.6
602.2
553.3
631.7
531.4
543.1
559.2
568.2
725.8
533.0
625.2
592.9
640.5
710.3
606.0
550.0
670.9
475.5
674.8
573.0
656.8
612.2
511.9
510.4
486.1
565.6
550.1
504.6
516.5
553.7
597.4
548.5
536.7
622.9
756.9
550.4
493.5
645.3
681.2
556.0
625.8
618.6
468.1
590.3
719.4
692.3
522.1
726.6
711.0
561.6
704.5
758.7
517.9
661.5
588.5
680.3
633.7
653.9
779.3
651.0
629.9
670.7
584.5
511.4
545.0
685.2
657.7
706.7
739.5
731.6
640.2
691.8
704.7
502.2
693.2
523.5
728.9
579.9
623.4
613.0
554.8
605.4
693.8
541.6
693.1
664.1
509.4
636.8
646.5
541.3
511.7
516.2
663.9
498.9
567.6
567.1
738.6
514.2
529.9
698.9
695.2
533.3
606.7
590.4
489.9
644.5
652.8
633.8
525.0
492.7
738.4
651.3
662.7
648.1
713.2
703.3
691.1
517.6
619.0
770.8
711.1
641.6
678.8
741.2
750.8
434.8
483.1
703.5
558.1
707.8
781.1
726.4
502.4
465.6
594.1
534.7
476.9
651.6
623.7
537.3
704.4
583.1
706.0
534.1
606.8
599.7
727.7
673.6
587.1
645.1
611.5
687.4
552.6
617.8
672.0
608.9
682.2
606.9
478.9
604.2
726.1
462.8
731.9
574.7
598.3
725.9
443.9
673.8
694.1
674.2
645.9
500.0
493.4
746.4
723.4
592.5
649.3
705.4
639.0
546.9
637.8
574.1
694.6
652.0
564.8
692.8
711.3
448.0
644.7
627.1
710.9
582.7
731.0
499.7
683.9
720.9
689.3
734.8
611.0
489.7
581.5
589.1
577.2
504.4
519.4
649.7
491.1
497.2
659.5
754.4
538.8
612.0
491.8
508.0
572.2
626.9
723.0
638.5
468.8
734.6
728.4
664.3
545.1
706.5
609.7
424.6
656.1
582.5
647.3
609.0
511.3
617.3
708.1
655.6
737.1
530.9
622.3
751.7
530.2
546.2
455.9
600.4
486.4
463.0
497.9
475.4
516.3
651.8
597.6
667.2
560.2
606.2
703.2
691.6
730.4
554.1
636.3
772.0
520.5
543.9
603.4
509.6
498.0
638.7
541.7
543.8
556.9
659.2
732.4
506.9
747.9
532.9
738.8
546.4
677.3
749.5
677.7
541.2
565.2
545.6
728.3
479.1
538.6
494.9
599.5
736.5
704.8
537.0
539.3
596.0
653.5
729.7
628.9
715.3
631.4
572.6
693.9
592.8
560.0
501.9
548.6
645.5
743.2
691.2
627.2
705.7
716.9
741.5
688.5
520.9
508.9
696.1
741.4
631.6
525.5
612.5
557.0
662.4
736.6
587.6
635.6
632.2
485.4
674.1
646.4
535.0
516.7
699.1
500.6
498.3
504.3
598.7
700.6
605.6
727.9
598.6
619.1
558.8
661.4
624.8
484.1
487.2
652.4
719.7
538.0
557.5
543.0
667.5
467.6
641.8
753.7
708.9
712.7
581.8
612.9
499.5
585.9
577.5
507.1
538.4
686.5
615.8
694.7
731.5
495.1
460.1
515.3
633.9
486.6
689.4
542.0
720.0
567.8
634.3
733.7
579.0
683.2
690.9
590.8
566.1
571.6
621.4
708.2
668.9
564.0
559.4
722.4
600.2
545.2
588.6
521.9
673.7
711.5
622.8
558.0
532.4
532.1
775.2
697.6
611.1
759.1
483.5
561.9
720.1
511.8
757.0
766.4
490.1
742.0
455.5
693.3
498.1
700.5
575.6
550.9
672.1
595.7
509.1
528.9
540.8
715.1
530.5
575.2
727.3
717.9
604.5
643.7
478.8
586.0
699.5
563.7
707.3
667.6
571.1
760.3
596.1
678.2
742.1
602.8
458.4
629.2
473.9
623.1
535.6
746.0
679.0
526.1
596.3
755.2
669.9
605.0
547.8
583.8
505.0
640.6
546.0
675.4
712.8
638.3
506.1
516.9
658.2
710.5
566.3
684.1
596.4
718.7
634.6
500.2
612.1
535.9
743.6
577.4
739.1
611.9
507.7
650.5
670.3
638.4
641.0
595.8
669.6
669.2
646.3
514.7
642.9
544.7
665.0
756.0
757.9
666.8
681.6
600.8
510.3
599.3
595.2
658.0
505.6
717.7
553.1
439.1
557.6
486.2
635.9
724.7
486.8
551.9
468.6
535.4
488.4
542.1
635.3
707.4
702.4
508.7
754.1
549.3
506.8
610.2
529.7
497.8
632.1
493.2
710.4
666.1
709.7
662.1
664.8
747.0
603.2
564.1
716.0
711.6
492.6
588.4
593.7
638.2
642.8
723.8
595.9
520.6
681.9
586.6
590.5
556.7
636.0
637.1
655.8
640.4
631.1
621.7
708.8
723.5
727.4
586.7
500.9
500.4
687.6
463.5
438.9
762.2
699.7
529.8
594.7
682.0
525.3
711.2
582.0
611.4
559.5
548.4
538.5
525.9
591.8
611.8
507.0
666.6
621.6
672.6
542.7
574.3
555.0
710.1
534.9
628.1
667.7
666.3
731.4
715.7
535.2
778.8
543.4
706.3
525.7
580.3
586.4
558.3
512.9
741.6
435.6
698.1
719.3
692.5
708.7
528.1
428.9
725.1
656.0
684.9
683.4
631.2
667.1
739.4
599.2
781.0
526.6
497.4
677.1
670.1
615.7
610.3
541.0
563.6
515.6
741.7
584.6
657.9
636.5
621.2
624.0
639.5
729.4
512.4
654.4
700.9
563.3
656.4
536.3
602.7
620.4
529.3
599.4
669.0
665.9
455.4
749.7
714.3
671.9
674.6
514.5
591.5
509.7
552.7
445.1
573.4
553.4
579.6
730.8
653.4
708.0
723.6
697.9
523.9
443.4
570.3
534.2
476.2
526.0
618.7
574.4
678.5
606.6
602.3
600.6
643.0
621.9
491.4
758.2
723.1
487.1
630.2
653.8
616.4
410.9
536.8
621.5
629.0
593.5
556.6
699.8
542.8
614.8
753.8
615.1
771.2
735.5
492.4
632.5
580.2
504.1
498.8
739.8
677.9
505.1
474.8
538.7
727.0
535.5
528.5
737.3
716.2
663.3
717.5
413.6
532.0
631.9
679.4
734.7
604.6
524.1
784.6
506.2
655.2
633.0
518.5
464.3
647.1
506.7
561.1
677.6
668.8
768.8
652.1
687.2
643.4
713.5
697.2
640.9
744.0
649.8
568.7
604.9
632.9
644.9
632.0
475.8
686.6
603.3
649.9
694.4
689.0
578.7
722.3
645.8
653.3
726.9
447.1
654.1
563.8
490.6
650.6
456.9
487.7
705.5
697.1
466.9
659.0
746.2
679.8
625.9
672.8
563.2
550.3
564.6
582.8
588.1
630.9
537.6
537.5
604.4
489.0
595.0
772.2
716.6
628.5
705.2
505.7
581.3
540.5
562.5
693.4
654.5
590.2
593.1
593.8
499.8
551.3
694.0
737.0
684.2
614.0
720.5
684.3
571.9
702.7
485.0
663.1
546.3
675.6
745.6
534.5
660.9
481.0
509.3
723.2
617.6
681.8
482.6
543.5
510.9
525.2
680.7
503.9
633.1
549.6
629.8
777.3
730.5
625.0
487.3
665.7
575.1
608.1
729.8
530.1
559.3
484.2
670.4
707.1
600.3
775.1
668.4
607.0
742.3
617.2
484.4
735.3
657.3
565.9
639.4
516.6
586.8
499.9
524.2
676.8
686.7
471.8
639.7
453.7
436.0
587.7
636.4
660.3
628.7
500.5
531.2
709.4
594.6
556.1
676.4
560.5
642.0
672.4
577.1
653.7
616.5
605.5
695.4
719.6
599.6
563.1
595.6
612.8
584.2
518.8
750.1
618.5
594.3
513.6
572.9
576.5
551.7
730.7
670.2
562.7
443.7
540.0
685.1
530.0
759.2
517.2
497.5
660.1
547.5
750.5
582.3
630.1
730.2
573.1
605.9
696.2
722.1
727.6
621.8
607.5
703.6
671.4
518.3
581.7
749.0
510.5
527.0
583.2
589.3
552.8
667.3
594.4
638.6
661.7
718.4
572.8
523.2
558.4
498.4
471.0
480.3
629.5
474.0
519.2
483.0
699.0
479.2
725.4
516.8
502.8
522.3
743.8
472.1
644.4
682.3
492.9
496.2
527.5
519.8
624.3
743.0
724.2
591.7
726.0
623.2
530.4
504.2
707.9
461.8
617.9
523.3
660.0
687.3
547.7
522.2
662.8
517.4
499.1
619.5
657.0
528.0
742.2
684.8
657.1
733.1
715.5
578.5
618.9
598.8
582.1
692.0
492.0
601.9
526.2
607.3
506.6
673.2
471.4
687.0
730.0
620.2
520.3
715.9
636.2
539.9
598.5
523.8
715.8
630.0
569.4
591.4
695.8
517.3
507.9
522.7
551.8
674.0
704.2
581.6
601.8
531.6
532.3
708.5
580.6
631.0
673.1
499.4
499.6
634.9
585.1
603.6
658.8
677.2
645.7
686.2
578.3
688.8
602.1
651.4
598.4
690.7
663.0
503.8
507.2
554.9
541.5
532.8
494.0
637.4
577.9
573.2
583.6
626.6
502.0
523.6
561.8
531.7
567.3
589.6
750.7
682.6
619.2
666.5
589.8
641.3
519.1
598.1
472.6
691.9
724.0
648.7
600.1
433.8
555.9
531.1
513.8
490.5
501.4
491.6
709.5
440.8
683.3
544.6
475.6
689.8
547.1
488.3
680.6
488.7
624.1
636.7
696.3
551.4
557.2
758.1
676.2
418.5
706.4
660.5
538.1
713.4
475.2
654.6
562.4
729.9
521.0
736.7
507.8
701.3
697.4
750.4
446.2
438.5
646.9
494.5
479.9
477.3
576.3
671.2
694.9
743.3
737.7
593.2
510.0
744.2
667.8
497.0
591.0
609.1
710.0
595.5
489.5
529.4
550.7
607.8
533.1
495.6
669.3
751.4
587.4
635.0
666.7
735.1
685.7
602.6
484.6
744.6
518.9
548.0
591.9
599.1
448.2
713.6
547.4
761.8
741.0
550.2
712.1
527.4
684.7
470.6
745.1
536.0
719.2
558.9
695.6
708.3
589.9
682.9
590.7
618.8
716.8
481.4
753.9
586.2
680.4
580.7
594.0
717.3
688.0
489.4
699.3
604.3
727.8
498.6
768.4
712.6
545.9
517.1
486.0
659.3
714.8
587.0
617.7
539.1
626.8
664.5
604.0
605.1
524.4
752.8
763.8
623.6
736.4
503.5
635.1
505.9
628.3
703.0
578.0
676.7
583.3
608.8
528.8
527.3
668.5
722.8
685.6
553.9
539.2
540.1
519.9
740.5
639.6
503.7
494.7
688.2
577.3
512.6
467.5
498.5
459.4
495.4
694.2
676.1
474.2
609.5
789.4
442.6
644.6
689.2
585.7
524.8
657.8
776.2
651.2
597.7
601.7
782.5
579.4
565.1
417.9
697.7
734.0
504.9
523.4
726.3
563.4
644.8
505.8
635.8
724.9
739.0
674.3
649.1
603.1
705.9
653.6
515.1
738.7
616.3
483.7
753.5
542.9
650.9
584.7
583.9
646.6
710.8
613.1
557.1
666.0
666.2
549.4
590.0
739.6
641.5
560.8
592.0
745.7
494.6
593.0
662.3
566.0
635.4
535.1
471.6
659.9
543.6
562.0
572.7
543.2
605.3
655.5
491.9
637.3
658.9
637.2
624.2
533.2
601.1
480.6
619.3
582.4
706.9
734.3
711.9
753.0
604.8
512.7
615.3
423.1
733.8
493.0
678.3
664.4
695.9
513.4
512.5
658.3
627.7
690.3
417.1
638.8
524.9
562.1
578.1
515.8
639.2
495.8
525.8
643.8
724.4
514.4
686.0
688.9
495.7
691.7
587.9
696.5
644.2
699.6
568.4
696.6
681.7
663.2
495.0
613.9
671.6
548.3
752.9
742.9
533.4
682.1
675.1
671.0
511.0
625.6
630.7
740.6
481.1
626.3
441.1
557.7
676.6
630.3
622.2
506.3
484.3
656.6
657.2
597.8
490.9
512.2
567.4
487.9
496.3
694.5
668.1
652.9
719.8
580.4
632.7
686.3
672.5
520.0
649.0
544.3
566.6
492.1
480.5
570.5
522.8
689.9
615.0
623.5
647.8
712.3
700.3
688.1
607.6
624.9
462.4
559.6
734.5
616.8
615.6
648.8
524.0
658.6
524.5
547.9
641.7
562.6
653.0
552.3
496.5
521.5
571.8
656.7
551.6
531.9
550.5
560.4
549.1
591.2
673.5
751.9
765.3
698.4
614.4
718.1
569.5
489.2
545.8
620.7
613.4
593.4
752.5
465.0
600.9
537.8
663.7
716.7
623.3
659.4
552.1
754.3
453.1
696.4
724.6
586.1
733.6
734.9
701.5
544.8
676.0
463.9
689.5
709.9
740.2
673.9
642.3
606.4
665.4
714.0
585.5
529.5
567.2
720.4
679.5
640.3
638.1
607.9
643.2
697.8
662.6
756.2
606.1
527.7
734.1
701.2
701.9
564.5
641.1
712.2
748.5
553.6
645.6
564.3
660.6
615.5
561.4
722.9
719.1
631.3
660.2
475.1
640.1
694.8
530.6
643.1
472.5
607.4
528.3
560.7
733.3
666.4
685.5
597.5
485.6
500.8
537.2
613.7
482.2
652.3
576.2
521.2
698.5
645.4
620.9
609.6
568.3
665.2
544.4
519.0
683.1
775.6
481.2
568.0
546.1
638.0
549.8
689.6
572.1
532.7
548.7
664.2
667.0
542.3
685.0
628.6
568.6
620.0
557.9
661.3
768.2
637.0
561.2
530.8
648.3
597.0
601.5
571.3
735.7
647.7
624.4
509.9
477.4
642.4
522.4
601.3
519.5
659.6
487.8
732.7
619.4
610.1
642.1
553.8
701.4
581.0
733.0
724.5
745.4
554.6
544.0
679.9
611.3
721.1
680.2
527.8
602.5
586.5
549.2
642.7
600.0
675.2
540.6
592.2
714.6
613.5
509.8
629.1
713.7
732.5
690.5
555.5
759.6
499.2
648.9
651.1
556.3
449.7
704.1
718.8
614.3
532.2
633.6
534.4
652.7
482.0
733.4
683.8
589.5
639.1
613.2
731.3
668.3
503.4
644.3
685.4
595.4
732.1
726.8
650.8
513.9
514.6
580.9
579.8
560.6
660.7
695.0
715.0
481.8
545.5
519.6
723.7
650.0
527.1
588.0
575.5
722.7
619.8
598.9
717.8
481.5
729.2
696.9
542.6
542.2
558.6
746.3
502.7
533.5
517.8
731.2
553.5
709.2
581.1
628.2
548.9
531.8
588.2
740.0
636.1
418.1
495.9
548.1
549.9
715.6
533.7
700.8
675.9
753.6
566.7
518.2
514.9
449.5
562.9
705.0
732.8
526.7
564.7
571.0
514.3
487.5
627.0
602.9
620.3
552.2
601.6
655.9
739.3
672.3
476.6
697.3
503.2
726.7
709.0
509.2
721.5
656.5
706.8
637.9
656.3
692.9
634.7
566.9
735.8
549.7
439.4
629.3
679.7
506.0
750.3
702.0
547.2
534.3
756.1
596.7
543.7
707.2
721.7
738.2
411.9
685.3
492.5
596.6
718.9
617.1
688.3
621.3
721.9
692.2
565.4
654.3
718.0
651.9
578.4
478.1
585.0
728.2
655.7
703.7
602.4
731.8
541.9
489.3
537.7
664.0
658.7
645.0
684.6
687.7
528.6
616.0
574.2
653.1
632.6
714.1
669.8
625.3
709.1
468.9
567.9
618.0
589.2
551.0
626.1
503.1
572.4
575.0
606.3
547.0
472.8
655.4
698.8
724.1
673.3
745.8
488.0
669.7
630.8
607.7
636.6
576.1
633.5
531.5
701.7
689.1
624.7
704.6
679.3
625.1
519.3
557.8
729.3
580.5
650.1
736.8
481.6
587.2
705.1
517.5
706.1
711.4
572.0
583.0
717.2
511.1
520.8
489.1
717.0
736.2
601.0
617.5
660.4
664.6
729.6
661.8
694.3
567.5
590.6
574.5
658.4
701.6
685.9
490.4
722.6
713.3
553.0
557.3
475.9
690.2
755.5
513.1
527.9
730.1
538.2
652.6
425.1
630.6
541.1
712.5
641.4
464.7
617.4
556.2
732.3
706.2
482.9
696.7
469.7
721.2
496.7
574.0
607.2
513.5
544.9
614.2
671.8
527.2
713.0
650.7
702.6
524.3
574.6
629.6
669.1
485.1
621.0
626.5
709.6
528.4
603.5
665.6
609.4
552.5
510.7
584.1
505.3
536.4
714.4
566.5
661.6
479.5
574.9
680.0
725.6
704.3
592.7
515.0
526.4
647.2
650.3
707.0
700.7
569.8
751.0
540.9
695.1
529.0
616.9
556.4
624.6
618.3
715.2
558.5
573.7
599.0
585.6
743.9
615.2
564.9
758.3
445.6
611.7
539.7
690.1
678.0
701.1
515.9
548.2
557.4
486.5
608.0
706.6
764.7
639.8
641.9
594.5
486.9
523.7
561.0
672.9
712.9
620.1
567.0
655.0
536.1
621.1
695.3
690.6
539.0
714.2
748.3
687.1
520.7
653.2
516.4
569.3
485.8
509.0
577.6
642.5
700.2
735.9
692.7
539.5
574.8
493.3
716.5
455.8
564.2
538.3
740.7
674.4
614.6
646.1
774.1
739.2
510.8
570.7
546.5
682.4
584.4
700.0
726.2
648.4
602.0
695.5
661.0
665.1
674.7
608.3
508.4
586.3
578.2
625.7
449.9
627.4
579.5
584.8
577.8
471.1
703.8
576.6
664.9
702.3
522.6
532.6
628.8
568.8
630.4
741.3
711.8
552.9
570.6
545.4
686.9
592.4
646.0
670.0
637.5
566.2
620.6
721.0
569.6
716.3
479.4
603.8
733.5
580.8
459.5
579.1
535.3
547.6
488.9
622.4
585.2
627.8
565.8
633.3
757.2
728.0
518.7
589.0
679.2
659.8
524.6
608.6
679.1
677.4
521.3
503.0
741.1
635.2
455.7
533.9
726.5
619.7
544.2
748.8
503.6
548.8
554.5
676.9
530.7
555.6
671.7
720.6
761.6
701.0
493.1
537.1
473.1
720.8
666.9
569.9
718.3
708.6
648.6
490.0
686.1
693.6
566.4
552.0
537.4
576.9
585.3
476.8
559.7
675.3
612.4
739.7
651.7
690.8
580.1
648.0
501.5
697.0
605.2
618.1
648.5
696.0
772.9
588.8
686.8
610.5
629.4
619.6
577.7
431.4
681.3
478.4
720.3
640.7
703.1
689.7
646.8
741.8
654.2
635.7
699.2
521.4
520.1
430.2
570.1
508.2
716.1
720.7
529.6
660.8
702.5
717.4
649.4
564.4
634.1
606.5
614.9
583.7
610.8
725.0
598.2
758.4
614.1
633.4
676.3
673.4
698.2
503.3
518.1
544.5
518.0
594.8
592.1
479.3
652.2
561.5
506.5
604.1
512.3
494.1
579.2
546.8
719.5
592.3
690.4
587.8
562.2
522.0
559.0
737.4
495.3
658.5
655.1
597.3
716.4
698.3
742.6
634.5
675.7
710.7
541.4
585.4
542.5
681.1
589.7
728.8
740.9
683.0
745.3
663.5
572.3
710.2
492.3
703.9
588.3
480.0
625.4
709.3
570.8
555.1
737.5
673.0
525.1
646.7
531.0
551.1
505.4
622.1
677.0
565.0
670.6
674.5
432.7
514.0
620.8
545.7
693.0
545.3
728.1
591.3
617.0
569.2
437.3
518.6
571.7
651.5
526.8
775.7
583.5
674.9
578.9
560.3
661.2
649.5
744.9
555.2
661.1
599.8
570.0
770.4
740.8
647.5
747.5
596.5
576.4
573.5
623.9
488.6
515.2
429.6
488.2
566.8
588.7
640.0
559.1
712.4
654.9
590.9
747.1
672.2
597.2
490.3
604.7
704.0
650.4
539.6
700.4
534.6
745.5
589.4
730.3
748.2
527.6
593.6
728.5
584.9
681.5
502.6
488.1
632.3
690.0
484.5
668.2
613.8
698.0
687.9
702.9
628.4
508.5
512.1
652.5
474.6
709.8
491.5
483.4
555.8
425.8
637.6
553.2
629.7
732.2
672.7
536.9
479.0
630.5
735.4
559.8
681.0
576.7
504.7
708.4
